app/controllers/registrations_controller.rb

INSERT INTO "registrations" ("created_at", "token", "updated_at", "full_name", "email") VALUES('2010-01-02 04:59:30', 'b37e300dbc113055b2b5fcf6b58aecfb', '2010-01-02 04:59:30', 'a', 'a@b.com')
---
  def create
    @registration = Registration.new params[:registration]
    if @registration.save

SELECT * FROM "registrations" WHERE ("registrations"."token" = 'f8ae2c325e825f5ecb71cd89536b88f0') LIMIT 1
---
  def show
    @registration = Registration.find_by_token! params[:id]

SELECT * FROM "registrations" WHERE ("registrations"."token" = 'f8ae2c325e825f5ecb71cd89536b88f0') LIMIT 1
DELETE FROM "registrations" WHERE ("registrations"."email" = 'poo@alaska.edu')
---
  def update
    @registration = Registration.find_by_token! params[:id]
    @person = Person.new params[:person]
    if @person.save
      Registration.delete_all :email => @registration.email